{
  "1": "Upload file to the cloud #1",
  "12": "Batch Image Compression #1",
  "13": "Upload file to the cloud #1",
  "compress-images-using-tinypng-api-to-reduce-file-size-while-main": "A user-friendly image compression toolkit that helps you reduce image file sizes while maintaining quality using advanced compression algorithms.",
  "display-name": "Tiny PNG",
  "images-compression-1": "Images Compression #1",
  "image-compression": "Image Compression",
  "compress-images-using-tinypng-api-to-reduce-file-size-while-main2": "Compress images using TinyPNG API to reduce file size while maintaining quality",
  "path-to-the-input-image-file-png-jpg-or-webp": "Path to the input image file (PNG, JPG, or WebP)",
  "path-for-the-compressed-output-image-optional-auto-generated-if": "Path for the compressed output image (optional, auto-generated if null)",
  "images-compression": "Images Compression",
  "bulkly-compress-the-pictures-in-a-folder-and-save-them-to-the-ta": "Bulkly compress the pictures in a folder and save them to the target folder specified by the user.",
  "map-1": "Map #1",
  "list-files-from-folder-1": "List files from folder #1",
  "filter-files-1": "Filter Files #1",
  "images-compression2": "Images Compression",
  "bulk-compress-images-in-a-folder-and-save-them-to-the-target-dir": "Bulk compress images in a folder and save them to the target directory",
  "source-folder-containing-images-to-compress": "Source folder containing images to compress",
  "destination-folder-for-compressed-images-optional-defaults-to-so": "Destination folder for compressed images (optional, defaults to source folder)",
  "tinify-image-compression-1": "Tinify Image Compression #1",
  "image-file-tinify-compress-1": "Image File Tinify Compress #1",
  "image-file-tinify-compress-2": "Image File Tinify Compress #2",
  "image-url-tinify-compression": "Image Url Tinify Compression",
  "compress-images-using-tinify-api-to-reduce-file-size-while-maint": "Compress images using Tinify API to reduce file size while maintaining quality. This task accepts an image URL, processes it through the Tinify compression service, downloads the compressed result, and saves it locally. It provides both the compressed image URL and local file path as outputs.",
  "url-of-the-image-to-compress-accepts-any-valid-online-image-url": "URL of the image to compress. Accepts any valid online image URL (HTTP/HTTPS). The image will be fetched and sent to Tinify API for compression. Supported formats include PNG, JPEG, and other common image formats.",
  "optional-custom-save-path-for-the-compressed-image-file-if-not-s": "Optional custom save path for the compressed image file. If not specified (null), the file will be automatically saved to the OOMOL storage directory with a unique timestamp-based filename. When specified, provide an absolute file path including the filename and extension.",
  "url-of-the-compressed-image-hosted-on-the-tinify-service-this-ur": "URL of the compressed image hosted on the Tinify service. This URL can be used to access the compressed image directly or for further processing. The URL remains accessible for a limited time according to Tinify's retention policy.",
  "absolute-local-file-path-where-the-compressed-image-has-been-sav": "Absolute local file path where the compressed image has been saved. The file is stored either at the custom save_path (if provided) or in the OOMOL storage directory (/oomol-driver/oomol-storage/) with a generated filename in format 'compressed_[timestamp].[ext]' where extension is .png or .jpg based on the image content type.",
  "image-file-tinify-compress": "Image File Tinify Compress",
  "compress-a-local-image-file-using-tinify-api-this-subflow-orches": "Compress a local image file using Tinify API. This subflow orchestrates a two-step process: first uploading the local image file to cloud storage to obtain a URL, then compressing the image via the Tinify service. The workflow provides both a cloud URL and local file path for the compressed result, making it suitable for batch processing or integration with other image workflows.",
  "local-image-file-path-to-compress-provide-an-absolute-path-to-an": "Local image file path to compress. Provide an absolute path to any image file (PNG, JPEG, etc.) stored on the local filesystem. The file will be uploaded to cloud storage first, then compressed using the Tinify API.",
  "optional-destination-path-for-saving-the-compressed-image-if-not": "Optional destination path for saving the compressed image. If not specified (null), the compressed image will be saved to the OOMOL storage directory with an auto-generated filename. When provided, specify an absolute file path including the desired filename and extension.",
  "url-of-the-compressed-image-hosted-on-tinify-service-this-url-pr": "URL of the compressed image hosted on Tinify service. This URL provides direct access to the compressed image and can be used for sharing or further processing. The URL has a limited retention period based on Tinify's service policies.",
  "absolute-local-file-path-where-the-compressed-image-has-been-sav2": "Absolute local file path where the compressed image has been saved. The file location is either the custom save_path (if provided) or an auto-generated path in the OOMOL storage directory (/oomol-driver/oomol-storage/) with format 'compressed_[timestamp].[ext]'.",
  "tinify-image-compression-2": "Tinify Image Compression #2",
  "array-of-absolute-file-paths-for-all-successfully-compressed-ima": "Array of absolute file paths for all successfully compressed images. Each element in the array represents a compressed image file path, either saved to the specified destination_folder or to the OOMOL storage directory. The array preserves the processing order of images from the source folder. Can be used for further batch processing, archiving, or validation workflows.",
  "image-file-tinify-compress-12": "Image File Tinify Compress #1"
}
